<?php

use Illuminate\Support\Facades\Facade;
use Illuminate\Http\Request;

return [
    'api_keys'       => [
        'vk' => [
            'url_key'        => 'https://api.vk.com/method/wall.get?v=5.81&access_token=',
            'items_key'      => 'items',
            'text_key'       => 'text',
            'channel_id_key' => 'owner_id',
            'url_channel_key'=> 'owner_id', 
            'url_limit_key'  => 'count', 
            'error_key'      => 'error'
        ],
        'tg' => [
            'url_key'        => 'http://127.0.0.1:9503/api/getHistory/?',
            'items_key'      => 'messages',
            'text_key'       => 'message',
            'channel_id_key' => 'peer_id', 
            'channel_sub'    => 'channel_id', // ключ дочернего объекта
            'user_sub'       => 'user_id',    // ключ дочернего объекта
            'url_channel_key'=> 'data[peer]', 
            'url_limit_key'  => 'data[limit]', 
            'error_key'      => 'errors'
        ]
    ],
    
    'currencies'     => [
        "dollar" => "Доллар",
        "euro" => "Евро",
        "hrn" => "Гривна",
        "cashless" => "Безнал руб."
    ],
    'currencies_loc'  => [
        "dollar" => "доллара",
        "euro" => "евро",
        "hrn" => "гривны (Ощад, Приват, Моно)",
        "cashless" => "безнала руб. (Сбер, Тиньков)"
    ],
    'symbols'  => [
        "dollar" => "USD",
        "euro"   => "EUR",
        "hrn"    => "UAH"
    ],
     'date_sort'      => [
        //  1   => "1 час",
         5   => "5 часов",
         24  => "24 часа",
         168 => "7 дней",
        //  720 => "30 дней"
     ],

    'course_patterns' => [
        "sell_dollar"      => '/(Прод|прод|ПРОД|[бо]мен[яи])(.*)(\$|Дол|ДОЛ|дол|бел[ыо][йг]|син|зел|💵)/', 
        "sell_euro"        => '/(Прод|прод|ПРОД|[бо]мен[яи])(.*)(\€|евро|Евро|ЕВРО)/',
        "sell_hrn"         => '/(Прод|прод|ПРОД|[бо]мен[яи]|Пополн|пополн)(.*)(Грив|грив|ГРИВ|Грн|ГРН|грн|\sгр\s|\sгр\.|укр|Укр|Приват|приват|ПРИВАТ|Ощад|ощад|ОЩАД|Моно|моно)/',
        "sell_cashless"    => '/(Прод|прод|ПРОД|[бо]мен[яи]|Пополн|пополн)(.*)(Сбер|сбер|СБЕР|[Тт]инько)/',
        
        "buy_dollar"       => '/(Куп|куп|КУП)(.*)(\$|Дол|ДОЛ|дол|бел[ыо][йг]|син|зел|💵)/',
        "buy_euro"         => '/(Куп|куп|КУП)(.*)(\€|евро|Евро|ЕВРО)/',
        "buy_hrn"          => '/(Куп|куп|КУП|Обналич|обналич)(.*)(Грив|грив|ГРИВ|Грн|ГРН|грн|\sгр\s|\sгр\.|укр|Укр|Приват|приват|ПРИВАТ|Ощад|ощад|ОЩАД|Моно|моно)/',
        "buy_cashless"     => '/(Куп|куп|КУП|Обналич|обналич)(.*)(Сбер|сбер|СБЕР|[Тт]инько)/'
    ],
    
    'rate_patterns'   => [
        // маска захватывает символы до и после курса, чтобы убедиться, что мы не попали на часть номера телефона, суммы или других чисел
        "dollar"      => '/\D{2}[189](\d{1,2}$|\d{1,2}\D{2,3}|\d([\.\,]\d?)\d$|\d([\.\,]\d*)\D{2})|[189][0-9][0-9]?([\.\,]\d{0,2})?-[189][0-9][0-9]?([\.\,]\d{0,2})?/',
        // пока евро одинаковый с долларом
        "euro"        => '/\D{2}[189](\d{1,2}$|\d{1,2}\D{2,3}|\d([\.\,]\d?)\d$|\d([\.\,]\d*)\D{2})|[189][0-9][0-9]?([\.\,]\d{0,2})?-[189][0-9][0-9]?([\.\,]\d{0,2})?/', 
        "hrn"         => '/(\D[-\s\(\)][12]([\.\,]\d{0,2})(\d$|\D\D))|[12]([\.\,]\d{1,2})?\s?-\s?[12]([\.\,]\d{0,2})?/',
        "cashless"    => '/(1[\s]?[к\:х\*\/][\s]?1)|(\d+[\.\,])?\d+\s?\%/'
    ],

    'rate_digit_pattern' => '/\d*[\.\,]?\d+/'

];
