<div class="footer_content">
    Это <a target="_blank" href="https://github.com/danwalt2000/kursivalut">open-source проект</a> - каждый может развернуть у себя его копию, сделать доработки и pull request. <br>
    <a href="https://sharpdesign.ru">Разработчик</a> не имеет отношения ни к площадкам, на которых публикуются объявления, ни к лицам, их публикующим. Вся информация на сайте взята из открытых источников и предоставляется исключительно для проведения исследовательской деятельности.
</div>